{"type":"FeatureCollection","features":[{"type":"Feature","properties":{"OBJECTID":1,"Crime":"Robbery","Address":"33 Hurt Plaza Parking Deck","Date":"8/20/16","IncidentDescription":"A Strong Armed Robbery was reported to Atlanta Police Department at approximately 11:00 a.m. at Hurt Plaza Parking Deck. A GSU student stated as she was entering the parking deck she was approached by an unknown black male who demanded her cell phone and hit her on the hip. The victim did not require medical treatment.\n\n","Suspects":"The suspect is described as a black male, 6’3″ in height, dark complexion, slender build, low haircut. The suspect was wearing a red shirt and blue jeans. He is said to be between 19-23 years in age.","Time":"11:00 AM"},"geometry":{"type":"Point","coordinates":[-84.387639,33.754352]}},{"type":"Feature","properties":{"OBJECTID":2,"Crime":"Snaft Theft","Address":"38 Peachtree Center Ave","Date":"9/2/16","IncidentDescription":"A Snatch Theft was reported to Georgia State University Police Department at approximately 4:54p.m. at 38 Peachtree Center (Bus Stop). The victim stated her cell phone was snatched while she stood at the bus stop.","Suspects":"The first suspect is described as a black male, dark complexion with black hair wearing black shorts red shirt. The second suspect is described as  black male, dark complexion, black hair,  wearing a white shirt and light colored pants. They were last seen fleeing west towards Woodruff Park.","Time":"4:54 PM"},"geometry":{"type":"Point","coordinates":[-84.38605,33.75915]}},{"type":"Feature","properties":{"OBJECTID":3,"Crime":"Shooting","Address":"Jessie Hill Jr Drive and Edgewood (intersection)","Date":"9/15/16","IncidentDescription":"It was reported to Georgia State University Police at 3:45 am that an argument occurred between three non-GSU individuals resulting in one person being shot. It appears that the suspect and victim knew each other.","Suspects":"The suspect is described as a short black male, slender build, afro and beard with gray hair. He was wearing a white t-shirt and blue jean shorts. The suspect fled the area with a black female wearing a white t-shirt, white cap, braids/dreads and a pocket book bag.","Time":"2:35 AM"},"geometry":{"type":"Point","coordinates":[-84.38034,33.754361]}},{"type":"Feature","properties":{"OBJECTID":5,"Crime":"Sexual Assualt","Address":"Wall Street","Date":"9/15/16","IncidentDescription":"A Sexual Battery was reported to Georgia State University Police Department on September 16, 2016. The victim stated while walking on Wall Street she was approached by a black male asking her for water from her water bottle. The victim stated the male then put his arms around her upper torso and told her she was pretty and kissed her on the forehead.","Suspects":"The suspect is described as a black male, in his mid-forties, around 5-10 to 6-00 in height.  ","Time":"12:30 PM"},"geometry":{"type":"Point","coordinates":[-84.389481,33.753281]}},{"type":"Feature","properties":{"OBJECTID":6,"Crime":"Assualt","Address":"MLK and Moore Street","Date":"9/21/16","IncidentDescription":"An Aggravated Assault was reported to Georgia State University Police Department at 9:21 a.m. A GSU student stated he confronted an unknown individual breaking into a car. The suspect pulled a gun on him and fled the area.","Suspects":"The suspect is described as a medium complexion black male approximately 5’10” with dreadlocks wearing a grey shirt and dark shorts (extra baggy) with tattoos on both arms. The suspect fled in a 2001 charcoal grey Jeep Cherokee.","Time":"9:21 AM"},"geometry":{"type":"Point","coordinates":[-84.380708,33.747482]}},{"type":"Feature","properties":{"OBJECTID":7,"Crime":"Battery","Address":"John Wesley Dobbs (parking lot across from One12)","Date":"9/17/16","IncidentDescription":"A Simple Battery and Theft by Taking  was reported to Georgia State University Police Department on September 22, 2016 that occurred on September 17, 2016 at 3:00 a.m.  A GSU student stated that while in the parking lot she was approached by an unknown individual who asked her a question. She also stated that she was physically attacked by three females and four males and her iPhone was stolen.","Suspects":"Suspect one: black male 5’10” in height medium build with twist in his hair.\n\nSuspect two: black male, 5’10” in height, slender build, blonde and black dreads wearing a plaid shirt.","Time":"3:00 AM"},"geometry":{"type":"Point","coordinates":[-84.384566,33.75698]}},{"type":"Feature","properties":{"OBJECTID":8,"Crime":"Attempted Robbery","Address":"85 Popular Street","Date":"10/4/16","IncidentDescription":"A GSU faculty member reported while in Slice restaurant an unknown male took his wallet. The faculty member chased the suspect and was able to retrieve his wallet.","Suspects":"The suspect is described as a dark skinned black male, slender build, approximately 6’2” in height, low haircut and wearing a navy blue shirt, blue jeans and wearing a GSU lanyard around his neck.","Time":"12:46 PM"},"geometry":{"type":"Point","coordinates":[-84.39003,33.75691]}},{"type":"Feature","properties":{"OBJECTID":11,"Crime":"Assault","Address":"Peachtree Street and Auburn Avenue","Date":"10/6/18","IncidentDescription":"A Georgia State University student reported that while walking to the Student Center West traveling south on Piedmont Avenue she was approached by an unknown individual who grabbed her breasts. There were no injuries reported.","Suspects":"Black male subject, 6’0” in height, wearing a red and white shorts and grey hooded sweat shirt. The subject also spoke in a deep, slurred voice. ","Time":"9:59 AM"},"geometry":{"type":"Point","coordinates":[-84.388424,33.75606]}},{"type":"Feature","properties":{"OBJECTID":12,"Crime":"Attempted Robbery","Address":"Peachtree Center Avenue and Ellis Street","Date":"1/8/17","IncidentDescription":"The victim reported that while he was walking on Peachtree Center Avenue, two male suspects attempted to rob him of his personal belongings.  The student advised that he had been assaulted by two unidentified black males near the intersection of Ellis St. and Peachtree Center Avenue. He also advised that there were no weapons involved in this incident. He advised that they tried to take his property, but he fought them off and they were only able to take the food he was carrying, which they later dropped on the ground as they fled possibly westbound down Peachtree Center Ave. The victim refused EMS.","Suspects":"Suspect One:\nBlack male, heavy set\n\nSuspect Two:\nMale, thin build, dreadlocks","Time":"3:30 PM"},"geometry":{"type":"Point","coordinates":[-84.385923,33.758322]}},{"type":"Feature","properties":{"OBJECTID":13,"Crime":"Shooting and Robbery","Address":"One12 (inside)","Date":"2/7/17","IncidentDescription":"The Atlanta Police notified Georgia State University Police at 5pm that a GSU student was shot inside of the 112 Courtland Apartments (off-campus housing). The student was transported to the hospital. The victim who lives off campus stated he was visiting someone when an unknown male attempted to rob them.","Suspects":"Suspect One:\nLight skinned black male\n6 feet in Height\nMedium length dreadlocks","Time":"5:00 PM"},"geometry":{"type":"Point","coordinates":[-84.384572,33.757341]}},{"type":"Feature","properties":{"OBJECTID":14,"Crime":"Robbery and Assault","Address":"One12 (inside)","Date":"2/8/17","IncidentDescription":"The Atlanta Police notified Georgia State University Police at 9:48 am that a GSU student was robbed with a knife of her backpack in the stairwell of 112 Courtland Apartments (off-campus housing). The victim was assaulted and sustained minor injuries.","Suspects":"Suspect One:\nLight skinned black male\nTall Slim in build\nLong dreadlocks down to his back\nSuspect Two:\nLight skinned black male\nLow clean cut afro\nWearing a white T-shirt that said “God is Dope”","Time":"9:48 AM"},"geometry":{"type":"Point","coordinates":[-84.384711,33.757287]}},{"type":"Feature","properties":{"OBJECTID":15,"Crime":"Robbery","Address":"Decatur and Collins Street","Date":"5/13/17","IncidentDescription":"A Non-GSU individual reported to the Georgia State University Police Department that she was robbed at gunpoint of her purse by two unknown black males. There were no injuries reported.","Suspects":"Suspect One:\nBlack male wearing lime green polo shirt and brown shorts\n\nSuspect Two:\nBlack male wearing shirt and dark pants","Time":"10:50 PM"},"geometry":{"type":"Point","coordinates":[-84.38658,33.75235]}},{"type":"Feature","properties":{"OBJECTID":18,"Crime":"Robbery","Address":"Jessie Hill Jr Drive and MLK","Date":"8/27/17","IncidentDescription":"A GSU Student was walking to Capitol Gateway apartments on Jessie Hill Drive at 4:15am when he was approached by two black males and robbed at gunpoint. The suspects drove away in a dark colored Mitsubishi Galant.","Suspects":"Suspect One:\nBlack Male dark skinned complexion\n5’9” 130-140 lbs.\nWearing white shirt\n \nSuspect Two:\nBlack Male dark skinned complexion\n5’8” 130-140 lbs.\nWearing white shirt","Time":"4:15 AM"},"geometry":{"type":"Point","coordinates":[-84.386342,33.748766]}},{"type":"Feature","properties":{"OBJECTID":19,"Crime":"Snatch Theft","Address":"Piedmont Avenue and John Wesley Dobbs","Date":"10/4/17","IncidentDescription":"Three GSU students were victims of snatch thefts on campus where their cell phones were taken from them by unknown suspects involving 2 separate vehicles. None of the students were harmed during the incidents and no weapons were involved.\n(The three incidents were delayed in being reported to the Police department)","Suspects":"Black Male slender build dark skinned complexion\r\nBlack male stocky build, dark complexion with dread hair style with blonde tips\r\n\r\nDescription of Vehicles:\r\nBlack Honda Civic\r\nWhite Nissan Sedan (Maxima or Altima with “Test Drive” tag)","Time":"11:45 AM"},"geometry":{"type":"Point","coordinates":[-84.382233,33.757056]}},{"type":"Feature","properties":{"OBJECTID":21,"Crime":"Snatch Theft","Address":"John Wesley Dobbs and Park Place","Date":"10/24/17","IncidentDescription":"A GSU student was approached by three black males who attempted to snatch her purse. One suspect pushed her to ground at which time they were able to take her cell phone. The suspects fled on foot traveling southbound on Park Place.","Suspects":"Three black male suspects, one wearing a black jacket.  Suspects appeared to be in the late 20’s to early 30’s.","Time":"7:35 PM"},"geometry":{"type":"Point","coordinates":[-84.387572,33.757096]}},{"type":"Feature","properties":{"OBJECTID":22,"Crime":"Attempted Robbery","Address":"Decatur and Peachtree Center Avenue (Langdale)","Date":"2/1/18","IncidentDescription":"Two witnesses contacted GSU police to report 3 black males attempting to snatch a phone from a GSU student near Langdale Hall. After GSUPD units met with the witnesses it was also confirmed the suspects attempted to take a laptop from another student. Contact was made with 3 suspects fitting the description, and 1 of the suspects was positively identified by 1 victim and a witness and promptly arrested. 1 cell phone was snatched from GSU student; the suspects were unsuccessful in attempting to take the laptop. No one was injured during this incident.","Suspects":"1 black male medium build wearing black hooded sweatshirt and grey beanie hat, 5 ‘6 in height\n\n1 black male thin build 5 ‘4 in height wearing a possible a black and red vest, red and white shoes\n\n1 black male thin build, wearing blue skinny jeans","Time":"11:16"},"geometry":{"type":"Point","coordinates":[-84.387492,33.753183]}},{"type":"Feature","properties":{"OBJECTID":23,"Crime":"Carjacking and Sexual Assault","Address":"John Wesley Dobbs and Courtland Street","Date":"4/12/18","IncidentDescription":"Atlanta Police Department reported a carjacking to GSU Police. A Non-GSU student was sitting in his car talking to a female GSU student when approached by two males asking for directions. The suspects drove away in the car.\n\nDescription of Vehicle: Red Pontiac G6","Suspects":"Suspect 1- Black male, wearing a beanie hat around 20 years of age.\r\n\r\nSuspect 2 – White male, wearing black pants and blue hooded jacket around 20 years of age.","Time":"3:54:00 AM"},"geometry":{"type":"Point","coordinates":[-84.384217,33.757023]}},{"type":"Feature","properties":{"OBJECTID":24,"Crime":"Sexual Battery ","Address":"92 Piedmont Avenue (Piedmont Central)","Date":"4/19/18","IncidentDescription":"A GSU student reported that an unknown black male grabbed her right buttocks as she was entering Piedmont Central Housing.","Suspects":"Black male approximately mid 20’s dark complexion, course hair and a beard. The subject was wearing a black jacket and dark colored sagging pants. His last direction of travel was south bound on Piedmont Avenue towards Patton Hall.","Time":"8:03 AM"},"geometry":{"type":"Point","coordinates":[-84.382962,33.757059]}},{"type":"Feature","properties":{"OBJECTID":25,"Crime":"Snatch Theft","Address":"Piedmont North","Date":"10/9/17","IncidentDescription":"Black male exited a silver or white Nissan Altima wearing red shirt, red hat and black pants snatched both victims’ phones and drove off in the vehicle. Last seen on Decatur Street going eastbound.","Suspects":"Description of Vehicles:\nWhite or Silver Nissan Sedan Altima with drive out tag","Time":"12:57 PM"},"geometry":{"type":"Point","coordinates":[-84.381786,33.759064]}},{"type":"Feature","properties":{"OBJECTID":26,"Crime":"Armed Robbery","Address":"Parking Lot on Piedmont Ave (across from Calhoun Park)","Date":"5/4/2018","IncidentDescription":"Georgia State University Police received a call from Atlanta Police  of an armed robbery of a Non-GSU individual.  The victim was robbed at gunpoint of his car keys, money and cell phone. There were no reported injuries.","Suspects":"Black male subject, 5’08” in height, wearing a blue shirt and blue jeans.  The direction of travel is unknown.","Time":"6:06 PM"},"geometry":{"type":"Point","coordinates":[-84.382413,33.755719]}},{"type":"Feature","properties":{"OBJECTID":27,"Crime":"Shooting","Address":"171 Auburn Avenue","Date":"1/16/2019","IncidentDescription":"The Atlanta Police responded to a Disturbance/Verbal Altercation between 2 Non-GSU males and 1 Non-GSU female. One male was shot in the leg. The male and female suspects fled North on Piedmont Ave toward John Wesley Dobbs from Calhoun Park then East on John Wesley Dobbs towards Jessie Hill. The Georgia State University Police Department also responded to assist the Atlanta Police Department with securing the scene.","Suspects":"1 Black male, 5'9\" in height, wearing camouflage pants, hooded jacket, multi-colored coat with a dreadlock hairstyle and armed with a handgun.  The black female was wearing dark clothing.","Time":"N/A"},"geometry":{"type":"Point","coordinates":[-84.381851,33.755211]}},{"type":"Feature","properties":{"OBJECTID":28,"Crime":"Robbery by Intimidation","Address":"Peachtree Street and Edgewood Avenue","Date":"2/22/16","IncidentDescription":"A GSU student reported after leaving class from Aderhold Learning Center he was approached from behind by an unknown individual who grabbed him and punched him in his forehead and demanded he hand over his cell phone and head phones. The suspect also demanded that he hand over his back pack but he refused. The suspect fled.","Suspects":"The suspect is described as a dark skinned black male, approximately 6’2” in height, wearing a khaki colored jacket wearing a baseball cap.","Time":"N/A"},"geometry":{"type":"Point","coordinates":[-84.389546,33.754567]}},{"type":"Feature","properties":{"OBJECTID":29,"Crime":"Armed Robbery","Address":"112 Courtland Street","Date":"4/27/16","IncidentDescription":"An Armed Robbery was reported to Atlanta Police Department on Wednesday, April 27, 2016. A GSU student reported exiting 112 Courtland Apartments and was approached by an unknown individual who robbed him of his iPhone and wallet.","Suspects":"The suspect is described as a light skinned black male, approximately 6’2” in height. He was seen getting into a 4 Door White Kia with a temporary tag.","Time":"N/A"},"geometry":{"type":"Point","coordinates":[-84.384808,33.757304]}},{"type":"Feature","properties":{"OBJECTID":30,"Crime":"Armed Robbery","Address":"Library North","Date":"1/28/16","IncidentDescription":"Two GSU students stated they were robbed at gunpoint of their computers.","Suspects":"The suspect is described as a black male, wearing black Adidas shorts, black top and a grey beanie. A person if interest is in custody.","Time":"7:41 AM"},"geometry":{"type":"Point","coordinates":[-84.38669,33.752572]}},{"type":"Feature","properties":{"OBJECTID":31,"Crime":"Armed Robbery","Address":"Library North","Date":"1/28/16","IncidentDescription":"Two GSU students stated they were robbed at gunpoint of their computers.","Suspects":"The suspect is described as a black male, wearing black Adidas shorts, black top and a grey beanie. A person if interest is in custody.","Time":"7:45 AM"},"geometry":{"type":"Point","coordinates":[-84.386685,33.752496]}},{"type":"Feature","properties":{"OBJECTID":32,"Crime":"Shooting","Address":"Piedmont Avenue and Ellis Street","Date":"3/21/16","IncidentDescription":"Officers responded to a shooting that occurred at the intersection of Piedmont Avenue and Ellis Street. Two individuals have been transported to Grady hospital. The situation is contained and there is no immediate threat to the community.","Suspects":"N/A","Time":"9:32 PM"},"geometry":{"type":"Point","coordinates":[-84.382273,33.758249]}},{"type":"Feature","properties":{"OBJECTID":33,"Crime":"Armed Robbery","Address":"Library North","Date":"1/14/16","IncidentDescription":"A GSU student was robbed at gunpoint by an unknown suspect of his MacBook and cell phone. There were no injuries reported.","Suspects":"The suspect was described as a black male, 6’ in height weighing 180 lbs. with a beard and low style haircut, wearing khaki pants, dark blue jacket and white shoes.","Time":"9:15 AM"},"geometry":{"type":"Point","coordinates":[-84.382273,33.7525]}},{"type":"Feature","properties":{"OBJECTID":34,"Crime":"Armed Robbery","Address":"One 12 Courtland Street","Date":"12/10/15","IncidentDescription":"Two GSU students were robbed at gunpoint in their private residence at One12 Courtland near Georgia State. Four black males armed with a gun entered the private location and robbed two individuals of a laptop and play station gaming system and left the area. There were no injuries reported.","Suspects":"One suspect was described as wearing a black hooded sweatshirt and the other three were wearing blue beanies on their head.","Time":"9:15 PM"},"geometry":{"type":"Point","coordinates":[-84.38461,33.75423]}},{"type":"Feature","properties":{"OBJECTID":35,"Crime":"Sexual Battery ","Address":"Peachtree Street (Near Popular Street)","Date":"11/11/15","IncidentDescription":"A GSU student was walking southbound on Peachtree Street at approximately 8:00 a.m. when she was approached by an individual that she had come in contact with before. The suspect started a conversation with her and grabbed her buttocks and abdomen area without her permission. Reported to GSU Police at 11:00 a.m.","Suspects":"The suspect is described as a light skinned, tall black male wearing a black hoodie, blue jeans, Adidas sneakers, peach fuzz moustache and a miniature afro, and appeared to be in his early 20’s.","Time":"8:00 AM"},"geometry":{"type":"Point","coordinates":[-84.388861,33.755625]}},{"type":"Feature","properties":{"OBJECTID":36,"Crime":"Assault","Address":"145 Edgewood Avenue (Grady Dialysis)","Date":"9/16/15","IncidentDescription":"A GSU student reported he was punched repeatedly by two unknown males that approached him as he was walking. The student refused medical treatment for his minor injuries.","Suspects":"Suspect number 1 is described as an Afro-American male with a light complexion, approximately 5’9”, medium muscular build, with a short haircut and wearing a gray tank top and khaki shorts. Suspect number 2 is described as a male who was wearing a blue shirt and basketball shorts, with a muscular build and a medium flat top haircut.","Time":"10:40 PM"},"geometry":{"type":"Point","coordinates":[-84.3647,33.7545]}},{"type":"Feature","properties":{"OBJECTID":37,"Crime":"Aggravated Assault","Address":"Hurt Park","Date":"8/29/15","IncidentDescription":"Atlanta Police Department responded to a stabbing in Hurt Park by an unknown individual. The victim was a Non-GSU individual. The victim was taken to Grady Hospital.","Suspects":"The suspects were described as follows: Suspect #1 is described as a black male with light skinned complexion wearing a red shirt, khaki shorts and fled the scene traveling southbound on Courtland. Suspect #2 is described as a black male wearing grey shirt and army fatigue pants and fled the scene traveling westbound on Edgewood. Both individuals had a knife in their possession.","Time":"12:50 PM"},"geometry":{"type":"Point","coordinates":[-84.35484,33.75916]}},{"type":"Feature","properties":{"OBJECTID":38,"Crime":"Armed Robbery","Address":"Piedmont Avenue (across from M deck)","Date":"5/28/15","IncidentDescription":"A GSU staff member reported he was robbed at gun point at 5:40 a.m. There were no injuries reported.","Suspects":"The suspect was described as a dark skinned black male medium build wearing all black with dreadlocks. The subjects fled the scene in a silver SUV unknown make and model heading north on Piedmont Avenue occupied by three other unknown suspects.","Time":"5:40 AM"},"geometry":{"type":"Point","coordinates":[-84.383575,33.753018]}},{"type":"Feature","properties":{"OBJECTID":39,"Crime":"Robbery","Address":"E Parking Lot","Date":"2/22/15","IncidentDescription":"A GSU student reported he was robbed by two individuals armed with a knife for his cell phone. There were no injuries reported.","Suspects":"Suspect number 1 is described as a Hispanic male, short in height wearing blue jeans, a pink shirt with writing, black jacket and black sneakers. Suspect number 2 is described as a black male, tall in height wearing a black hoodie with very little facial hair, grey sweat pants and black sneakers.","Time":"5:06 PM"},"geometry":{"type":"Point","coordinates":[-84.386332,33.75305]}},{"type":"Feature","properties":{"OBJECTID":40,"Crime":"Snaft Theft","Address":"Piedmont Avenue (University Commons Entrance)","Date":"12/8/18","IncidentDescription":"Suspect snatched a GSU student's cell phone as she was entering University Commons. The suspect fled East on foot down John Wesley Dobbs towards Jesse Hill Drive. No weapon was involved.","Suspects":"1 Black male, mid 30's approximately 5'7\" in height, black hair with a short black beard. The suspect was wearing a black hooded sweatshirt, black pants and a green poncho.","Time":"9:27 AM"},"geometry":{"type":"Point","coordinates":[-84.382125,33.757469]}},{"type":"Feature","properties":{"OBJECTID":41,"Crime":"Sexual Assualt","Address":"Library South / Library Plaza and Langdale Hall","Date":"9/18/18","IncidentDescription":"Georgia State University Police Department responded to calls of a suspicious person who groped the buttocks of two female students in the area of Langdale Hall, Library South and Library Plaza.  The subject was not located but he was identified as a short black male last seen wearing a blue shirt, camouflage pants, black sneakers, large headphones, and carrying a black backpack with grey trim.\n\nAtlanta Police received a report of a subject grabbed another female buttocks in the Auburn Ave area. He was described as black male, short haircut, black shirt with white lettering, black jeans with exposed blue underwear. GSU Police is working with APD to further investigate similarities of the cases and actively searching for this suspect.\n\n","Suspects":"Black male subject, 5’02” in height, wearing a blue shirt, camouflage pants, black sneakers, large headphones, carrying a black back pack with grey trim. ","Time":"12:58 PM"},"geometry":{"type":"Point","coordinates":[-84.386885,33.752949]}},{"type":"Feature","properties":{"OBJECTID":42,"Crime":"Snatch Theft","Address":"Decatur Street @ Park Place","Date":"6/1/18","IncidentDescription":"Suspect snatched the victim’s (GSU Staff) purse at the intersection of Decatur Street and Park Place. No weapon involved.","Suspects":"1 Black male, thin build mid 20’s wearing a black hooded sweatshirt over his head. Khaki shorts or pants.","Time":"4:59 PM"},"geometry":{"type":"Point","coordinates":[-84.388896,33.753854]}},{"type":"Feature","properties":{"OBJECTID":43,"Crime":"Simple Assualt","Address":"Peachtree Street and Auburn Avenue","Date":"10/6/16","IncidentDescription":"A Simple Assault was reported to Georgia State University Police Department. A GSU student stated that he was walking at the intersection of Peachtree Street and Auburn Avenue when an unknown suspect struck him in the face. The victim tried to call 911 but the suspect grabbed the phone and threw it on the ground and fled the area.","Suspects":"The suspect is described as a black male, 6’0” in height wearing a red UGA shirt. The suspect possibly changed into a white tank top.","Time":"4:16 PM"},"geometry":{"type":"Point","coordinates":[-84.388466,33.756211]}},{"type":"Feature","properties":{"OBJECTID":44,"Crime":"Snatch Theft","Address":"Equitable Place and Edgewood Avenue","Date":"4/18/16","IncidentDescription":"Georgia State University police have arrested a male juvenile suspect for the snatch theft robbery reported by a female GSU student on Monday, April 18. \nA Snatch Theft was reported to Georgia State University Police Department at approximately 1:01 p.m. at 25 Park Place (Intersection of Equitable Place and Edgewood Avenue). The victim stated her cell phone was snatched as she entered the building.","Suspects":"The victim positively identified the juvenile as the subject who snatched her Gold IPhone 6 cell phone and gave a written statement of the positive identification. Police arrested the suspect at the Fulton County Juvenile Detention Center on April 23.","Time":"12:56 PM"},"geometry":{"type":"Point","coordinates":[-84.387527,33.754569]}},{"type":"Feature","properties":{"OBJECTID":45,"Crime":"Armed Robbery","Address":"75 John Wesley Dobbs","Date":"1/24/2016","IncidentDescription":"An Armed robbery was reported to Atlanta Police Department at approximately 9:54 a.m. at 75 John Wesley Dobbs Avenue. A business Owner was robbed at gun point of her laptop as she opened her business.","Suspects":"The suspect is described as a black male, light - medium complexion with facial hair. The suspect was wearing a dark jacket and white hat. He is said to be late 20`s or early 30`s.","Time":"9:50 AM"},"geometry":{"type":"Point","coordinates":[-84.38514,33.75684]}}]}